# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated Resource

  with kubernetes_namespace.dialogporten,
  on k6_tests_rg_namespaces.tf line 6, in resource "kubernetes_namespace" "dialogporten":
   6: resource "kubernetes_namespace" "dialogporten" {

Deprecated; use kubernetes_namespace_v1.

(and 5 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rg_dp_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_resource_group.rg_studio_stag: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_resource_group.rg_studio_dev: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_resource_group.rg_dp_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_resource_group.rg_studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_resource_group.rg_studio_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 2s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 2s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 2s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster_node_pool.spot1c3g will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "spot1c3g" {
      + auto_scaling_enabled        = true
      + eviction_policy             = "Delete"
      + id                          = (known after apply)
      + kubelet_disk_type           = (known after apply)
      + kubernetes_cluster_id       = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster"
      + max_count                   = 40
      + max_pods                    = (known after apply)
      + min_count                   = 0
      + mode                        = "User"
      + name                        = "spot1c3g"
      + node_count                  = 0
      + node_labels                 = {
          + "kubernetes.azure.com/scalesetpriority" = "spot"
          + "spot1cpu3gbmem"                        = "true"
        }
      + node_taints                 = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version        = (known after apply)
      + os_disk_size_gb             = (known after apply)
      + os_disk_type                = "Managed"
      + os_sku                      = (known after apply)
      + os_type                     = "Linux"
      + priority                    = "Spot"
      + scale_down_mode             = "Delete"
      + spot_max_price              = -1
      + temporary_name_for_rotation = "tmpd1c3g"
      + ultra_ssd_enabled           = false
      + vm_size                     = "Standard_D1_v2"
    }

  # azurerm_kubernetes_cluster_node_pool.spot2c7g will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "spot2c7g" {
      + auto_scaling_enabled        = true
      + eviction_policy             = "Delete"
      + id                          = (known after apply)
      + kubelet_disk_type           = (known after apply)
      + kubernetes_cluster_id       = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster"
      + max_count                   = 20
      + max_pods                    = (known after apply)
      + min_count                   = 0
      + mode                        = "User"
      + name                        = "spot2c7g"
      + node_count                  = 0
      + node_labels                 = {
          + "kubernetes.azure.com/scalesetpriority" = "spot"
          + "spot2cpu7gbmem"                        = "true"
        }
      + node_taints                 = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version        = (known after apply)
      + os_disk_size_gb             = (known after apply)
      + os_disk_type                = "Managed"
      + os_sku                      = (known after apply)
      + os_type                     = "Linux"
      + priority                    = "Spot"
      + scale_down_mode             = "Delete"
      + spot_max_price              = -1
      + temporary_name_for_rotation = "tmpd2c7g"
      + ultra_ssd_enabled           = false
      + vm_size                     = "Standard_D2_v2"
    }

  # azurerm_kubernetes_cluster_node_pool.spot8c28g will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "spot8c28g" {
        id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster/agentPools/spot8c28g"
      ~ max_count                     = 5 -> 3
        name                          = "spot8c28g"
        tags                          = {}
        # (31 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Deprecated Resource

  with kubernetes_namespace.dialogporten,
  on k6_tests_rg_namespaces.tf line 6, in resource "kubernetes_namespace" "dialogporten":
   6: resource "kubernetes_namespace" "dialogporten" {

Deprecated; use kubernetes_namespace_v1.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `push` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan` |